createShipmentRequest/xml/createShipmentRequest.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/ship/v12">
   <SOAP-ENV:Body>
      <ProcessShipmentRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key/>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber/>
            <MeterNumber/>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId/>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>12</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
		 <RequestedShipment>
			<ShipTimestamp/>
			<DropoffType/>
			<ServiceType/>
			<PackagingType/>
			<Shipper>
				<AccountNumber/>
				<Contact>
					<PersonName/>
					<CompanyName/>
					<PhoneNumber/>
					<EMailAddress/>
				</Contact>
				<Address>
					<StreetLines/>
					<City/>
					<StateOrProvinceCode/>
					<PostalCode/>
					<CountryCode/>
				</Address>
			</Shipper>
			<Recipient>
				<Contact>
					<PersonName/>
					<CompanyName/>
					<PhoneNumber/>
					<EMailAddress/>
				</Contact>
				<Address>
					<StreetLines/>
					<City/>
					<StateOrProvinceCode/>
					<PostalCode/>
					<CountryCode/>
				</Address>
			</Recipient>
			<Origin>
				<Contact>
					<PersonName/>
					<CompanyName/>
					<PhoneNumber/>
					<EMailAddress/>
				</Contact>
				<Address>
					<StreetLines/>
					<City/>
					<StateOrProvinceCode/>
					<PostalCode/>
					<CountryCode/>
				</Address>
			</Origin>
			
			<ShippingChargesPayment>
				<PaymentType/>
				<Payor>
					<ResponsibleParty>
						<AccountNumber/>
						<Contact>
							<PersonName/>
							<CompanyName/>
							<PhoneNumber/>
							<EMailAddress/>
						</Contact>
						<Address>
							<StreetLines/>
							<City/>
							<StateOrProvinceCode/>
							<PostalCode/>
							<CountryCode/>
						</Address>
					</ResponsibleParty>
				</Payor>
			</ShippingChargesPayment>
			<CustomsClearanceDetail>
				<ImporterOfRecord>
					<AccountNumber/>
					<Contact>
						<PersonName/>
						<CompanyName/>
						<PhoneNumber/>
						<EMailAddress/>
					</Contact>
					<Address>
						<StreetLines/>
						<City/>
						<StateOrProvinceCode/>
						<PostalCode/>
						<CountryCode/>
					</Address>
				</ImporterOfRecord>
				<DutiesPayment>
					<PaymentType/>
					<Payor>
						<ResponsibleParty>
							<AccountNumber/>
							<Contact>
								<PersonName/>
								<CompanyName/>
								<PhoneNumber/>
								<EMailAddress/>
							</Contact>
							<Address>
								<StreetLines/>
								<City/>
								<StateOrProvinceCode/>
								<PostalCode/>
								<CountryCode/>
							</Address>
						</ResponsibleParty>
					</Payor>
				</DutiesPayment>
				<DocumentContent/>
				<CustomsValue>
					<Currency/>
					<Amount/>
				</CustomsValue>
				<CommercialInvoice>
					<Purpose/>
					<CustomerReferences>
						<CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
						<Value/>
					</CustomerReferences>
				</CommercialInvoice>
				<Commodities>
					<Name/>
					<NumberOfPieces/>
					<Description/>
					<CountryOfManufacture/>
					<Weight>
						<Units/>
						<Value/>
					</Weight>
					<Quantity/>
					<QuantityUnits/>
					<UnitPrice>
						<Currency/>
						<Amount/>
					</UnitPrice>
				</Commodities>				
			</CustomsClearanceDetail>
			<LabelSpecification>
				<LabelFormatType>COMMON2D</LabelFormatType>
				<ImageType>PNG</ImageType>
				<LabelStockType>PAPER_8.5X11_BOTTOM_HALF_LABEL</LabelStockType>
				<LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</LabelPrintingOrientation>
			</LabelSpecification>
			<RateRequestTypes>ACCOUNT</RateRequestTypes>
			<PackageCount/>
			<RequestedPackageLineItems>
				<SequenceNumber>1</SequenceNumber>
				<Weight>
					<Units/>
					<Value/>
				</Weight>
				<CustomerReferences>
					<CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
					<Value/>
				</CustomerReferences>
			</RequestedPackageLineItems>
	     </RequestedShipment>
	  </ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
